arzh_loadTest/get_ack_1.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 12.424ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 12.439ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.45ms  522.87us   6.40ms   69.28%
    Req/Sec   104.89    109.72   333.00     80.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.43ms
 75.000%    2.79ms
 90.000%    3.10ms
 99.000%    3.70ms
 99.900%    5.59ms
 99.990%    6.40ms
 99.999%    6.40ms
100.000%    6.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.042     0.000000            1         1.00
       1.791     0.100000          390         1.11
       2.014     0.200000          781         1.25
       2.171     0.300000         1171         1.43
       2.319     0.400000         1566         1.67
       2.433     0.500000         1950         2.00
       2.493     0.550000         2147         2.22
       2.569     0.600000         2342         2.50
       2.645     0.650000         2540         2.86
       2.721     0.700000         2735         3.33
       2.793     0.750000         2933         4.00
       2.835     0.775000         3024         4.44
       2.875     0.800000         3124         5.00
       2.921     0.825000         3218         5.71
       2.973     0.850000         3317         6.67
       3.033     0.875000         3416         8.00
       3.059     0.887500         3462         8.89
       3.097     0.900000         3511        10.00
       3.127     0.912500         3560        11.43
       3.171     0.925000         3608        13.33
       3.219     0.937500         3659        16.00
       3.245     0.943750         3681        17.78
       3.275     0.950000         3706        20.00
       3.309     0.956250         3731        22.86
       3.345     0.962500         3754        26.67
       3.391     0.968750         3779        32.00
       3.411     0.971875         3792        35.56
       3.427     0.975000         3804        40.00
       3.451     0.978125         3816        45.71
       3.505     0.981250         3827        53.33
       3.543     0.984375         3840        64.00
       3.573     0.985938         3846        71.11
       3.633     0.987500         3852        80.00
       3.651     0.989062         3858        91.43
       3.727     0.990625         3864       106.67
       3.789     0.992188         3870       128.00
       3.827     0.992969         3873       142.22
       3.885     0.993750         3876       160.00
       3.917     0.994531         3879       182.86
       3.973     0.995313         3882       213.33
       4.131     0.996094         3885       256.00
       4.331     0.996484         3887       284.44
       4.339     0.996875         3888       320.00
       5.247     0.997266         3890       365.71
       5.343     0.997656         3892       426.67
       5.515     0.998047         3893       512.00
       5.519     0.998242         3894       568.89
       5.519     0.998437         3894       640.00
       5.567     0.998633         3895       731.43
       5.591     0.998828         3896       853.33
       5.647     0.999023         3897      1024.00
       5.647     0.999121         3897      1137.78
       5.647     0.999219         3897      1280.00
       5.747     0.999316         3898      1462.86
       5.747     0.999414         3898      1706.67
       5.763     0.999512         3899      2048.00
       5.763     0.999561         3899      2275.56
       5.763     0.999609         3899      2560.00
       5.763     0.999658         3899      2925.71
       5.763     0.999707         3899      3413.33
       6.399     0.999756         3900      4096.00
       6.399     1.000000         3900          inf
#[Mean    =        2.454, StdDeviation   =        0.523]
#[Max     =        6.396, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.04
Transfer/sec:     18.56KB