arzh_loadTest/get_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.441ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.423ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms  499.65us   6.85ms   70.51%
    Req/Sec   105.08    109.47   333.00     80.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.42ms
 75.000%    2.74ms
 90.000%    3.03ms
 99.000%    3.55ms
 99.900%    6.25ms
 99.990%    6.85ms
 99.999%    6.85ms
100.000%    6.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.062     0.000000            1         1.00
       1.830     0.100000          391         1.11
       2.016     0.200000          782         1.25
       2.159     0.300000         1175         1.43
       2.287     0.400000         1566         1.67
       2.425     0.500000         1953         2.00
       2.483     0.550000         2147         2.22
       2.547     0.600000         2344         2.50
       2.615     0.650000         2535         2.86
       2.683     0.700000         2738         3.33
       2.745     0.750000         2927         4.00
       2.783     0.775000         3023         4.44
       2.821     0.800000         3120         5.00
       2.867     0.825000         3218         5.71
       2.921     0.850000         3315         6.67
       2.975     0.875000         3414         8.00
       2.995     0.887500         3464         8.89
       3.029     0.900000         3510        10.00
       3.059     0.912500         3560        11.43
       3.097     0.925000         3609        13.33
       3.137     0.937500         3657        16.00
       3.171     0.943750         3682        17.78
       3.211     0.950000         3705        20.00
       3.245     0.956250         3730        22.86
       3.265     0.962500         3755        26.67
       3.305     0.968750         3780        32.00
       3.323     0.971875         3791        35.56
       3.349     0.975000         3805        40.00
       3.377     0.978125         3815        45.71
       3.417     0.981250         3828        53.33
       3.451     0.984375         3840        64.00
       3.477     0.985938         3846        71.11
       3.519     0.987500         3852        80.00
       3.545     0.989062         3858        91.43
       3.563     0.990625         3864       106.67
       3.645     0.992188         3870       128.00
       3.663     0.992969         3873       142.22
       3.689     0.993750         3876       160.00
       3.725     0.994531         3879       182.86
       3.813     0.995313         3882       213.33
       3.919     0.996094         3885       256.00
       4.647     0.996484         3887       284.44
       5.035     0.996875         3888       320.00
       5.583     0.997266         3890       365.71
       5.611     0.997656         3891       426.67
       5.751     0.998047         3893       512.00
       5.847     0.998242         3894       568.89
       5.847     0.998437         3894       640.00
       5.911     0.998633         3895       731.43
       6.247     0.998828         3896       853.33
       6.267     0.999023         3897      1024.00
       6.267     0.999121         3897      1137.78
       6.267     0.999219         3897      1280.00
       6.327     0.999316         3898      1462.86
       6.327     0.999414         3898      1706.67
       6.335     0.999512         3899      2048.00
       6.335     0.999561         3899      2275.56
       6.335     0.999609         3899      2560.00
       6.335     0.999658         3899      2925.71
       6.335     0.999707         3899      3413.33
       6.851     0.999756         3900      4096.00
       6.851     1.000000         3900          inf
#[Mean    =        2.437, StdDeviation   =        0.500]
#[Max     =        6.848, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 556.83KB read
Requests/sec:    200.04
Transfer/sec:     18.56KB