arzh_loadTest/get_consistent.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 6.966ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.920ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.30ms  828.16us   5.92ms   67.90%
    Req/Sec   104.79    110.49   333.00     80.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.33ms
 75.000%    2.86ms
 90.000%    3.37ms
 99.000%    4.15ms
 99.900%    4.69ms
 99.990%    5.92ms
 99.999%    5.92ms
100.000%    5.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.349     0.000000            1         1.00
       1.147     0.100000          392         1.11
       1.590     0.200000          781         1.25
       1.875     0.300000         1171         1.43
       2.119     0.400000         1561         1.67
       2.325     0.500000         1953         2.00
       2.425     0.550000         2150         2.22
       2.525     0.600000         2344         2.50
       2.629     0.650000         2535         2.86
       2.747     0.700000         2733         3.33
       2.859     0.750000         2928         4.00
       2.925     0.775000         3026         4.44
       2.989     0.800000         3120         5.00
       3.071     0.825000         3219         5.71
       3.153     0.850000         3320         6.67
       3.263     0.875000         3413         8.00
       3.317     0.887500         3463         8.89
       3.371     0.900000         3511        10.00
       3.435     0.912500         3561        11.43
       3.507     0.925000         3608        13.33
       3.603     0.937500         3657        16.00
       3.643     0.943750         3681        17.78
       3.687     0.950000         3705        20.00
       3.735     0.956250         3731        22.86
       3.781     0.962500         3754        26.67
       3.835     0.968750         3779        32.00
       3.871     0.971875         3791        35.56
       3.905     0.975000         3803        40.00
       3.949     0.978125         3815        45.71
       4.017     0.981250         3827        53.33
       4.055     0.984375         3840        64.00
       4.089     0.985938         3846        71.11
       4.115     0.987500         3852        80.00
       4.143     0.989062         3858        91.43
       4.199     0.990625         3864       106.67
       4.259     0.992188         3870       128.00
       4.287     0.992969         3873       142.22
       4.339     0.993750         3876       160.00
       4.355     0.994531         3879       182.86
       4.391     0.995313         3882       213.33
       4.423     0.996094         3885       256.00
       4.443     0.996484         3887       284.44
       4.467     0.996875         3888       320.00
       4.495     0.997266         3890       365.71
       4.519     0.997656         3891       426.67
       4.559     0.998047         3893       512.00
       4.563     0.998242         3894       568.89
       4.563     0.998437         3894       640.00
       4.675     0.998633         3895       731.43
       4.691     0.998828         3896       853.33
       4.759     0.999023         3897      1024.00
       4.759     0.999121         3897      1137.78
       4.759     0.999219         3897      1280.00
       4.843     0.999316         3898      1462.86
       4.843     0.999414         3898      1706.67
       5.743     0.999512         3899      2048.00
       5.743     0.999561         3899      2275.56
       5.743     0.999609         3899      2560.00
       5.743     0.999658         3899      2925.71
       5.743     0.999707         3899      3413.33
       5.923     0.999756         3900      4096.00
       5.923     1.000000         3900          inf
#[Mean    =        2.304, StdDeviation   =        0.828]
#[Max     =        5.920, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 519.06KB read
  Non-2xx or 3xx responses: 2975
Requests/sec:    200.04
Transfer/sec:     17.30KB